app/views/users/show.html.erb

SELECT  "summoners".* FROM "summoners" WHERE "summoners"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
			<h1><%= @user.email %></h1>
			<% if @user.summoner.present? %>