app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$XGVrKGbJyaySIHNuYYNtRu9pdeQrVHI./lBFeCvBgZiZBoFUfgyTW"], ["updated_at", 2016-09-16 22:18:32 UTC], ["id", 149617800]]