app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

   def update
     @user = User.find(params[:id])
     if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 149617800], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$1wN54NahY9LefuUqR2IAXesNJNQiI/r2w0RFaUFp6xjxxx1XUmjtS"], ["admin", true], ["updated_at", 2016-09-16 14:20:21 UTC], ["id", 910516049]]